Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/bootloader_serial_flash/firmware/src/packs/ATSAMA5D29_DFP/component/sdmmc.h
/* -------- SDMMC_ACR : (SDMMC Offset: 0x208) (R/W 32) AHB Control Register -------- */
#define SDMMC_ACR_BMAX_Pos                    _UINT32_(0)                                          /* (SDMMC_ACR) AHB Maximum Burst Position */
#define SDMMC_ACR_BMAX_Msk                    (_UINT32_(0x3) << SDMMC_ACR_BMAX_Pos)                /* (SDMMC_ACR) AHB Maximum Burst Mask */
#define SDMMC_ACR_BMAX(value)                 (SDMMC_ACR_BMAX_Msk & (_UINT32_(value) << SDMMC_ACR_BMAX_Pos)) /* Assigment of value for BMAX in the SDMMC_ACR register */
#define   SDMMC_ACR_BMAX_INCR16_Val           _UINT32_(0x0)                                        /* (SDMMC_ACR) The maximum burst size is INCR16.  */
#define   SDMMC_ACR_BMAX_INCR8_Val            _UINT32_(0x1)                                        /* (SDMMC_ACR) The maximum burst size is INCR8.  */
#define   SDMMC_ACR_BMAX_INCR4_Val            _UINT32_(0x2)                                        /* (SDMMC_ACR) The maximum burst size is INCR4.  */
#define   SDMMC_ACR_BMAX_SINGLE_Val           _UINT32_(0x3)                                        /* (SDMMC_ACR) Only SINGLE transfers are performed.  */
#define SDMMC_ACR_BMAX_INCR16                 (SDMMC_ACR_BMAX_INCR16_Val << SDMMC_ACR_BMAX_Pos)    /* (SDMMC_ACR) The maximum burst size is INCR16. Position  */
#define SDMMC_ACR_BMAX_INCR8                  (SDMMC_ACR_BMAX_INCR8_Val << SDMMC_ACR_BMAX_Pos)     /* (SDMMC_ACR) The maximum burst size is INCR8. Position  */
#define SDMMC_ACR_BMAX_INCR4                  (SDMMC_ACR_BMAX_INCR4_Val << SDMMC_ACR_BMAX_Pos)     /* (SDMMC_ACR) The maximum burst size is INCR4. Position  */
#define SDMMC_ACR_BMAX_SINGLE                 (SDMMC_ACR_BMAX_SINGLE_Val << SDMMC_ACR_BMAX_Pos)    /* (SDMMC_ACR) Only SINGLE transfers are performed. Position  */
#define SDMMC_ACR_Msk                         _UINT32_(0x00000003)                                 /* (SDMMC_ACR) Register Mask  */


/* -------- SDMMC_CC2R : (SDMMC Offset: 0x20C) (R/W 32) Clock Control 2 Register -------- */
#define SDMMC_CC2R_FSDCLKD_Pos                _UINT32_(0)                                          /* (SDMMC_CC2R) Force SDCLK Disabled Position */
#define SDMMC_CC2R_FSDCLKD_Msk                (_UINT32_(0x1) << SDMMC_CC2R_FSDCLKD_Pos)            /* (SDMMC_CC2R) Force SDCLK Disabled Mask */
#define SDMMC_CC2R_FSDCLKD(value)             (SDMMC_CC2R_FSDCLKD_Msk & (_UINT32_(value) << SDMMC_CC2R_FSDCLKD_Pos)) /* Assigment of value for FSDCLKD in the SDMMC_CC2R register */
#define SDMMC_CC2R_Msk                        _UINT32_(0x00000001)                                 /* (SDMMC_CC2R) Register Mask  */


/* -------- SDMMC_RTC1R : (SDMMC Offset: 0x210) (R/W 8) Retuning Timer Control 1 Register -------- */
#define SDMMC_RTC1R_TMREN_Pos                 _UINT8_(0)                                           /* (SDMMC_RTC1R) Retuning Timer Enable Position */
#define SDMMC_RTC1R_TMREN_Msk                 (_UINT8_(0x1) << SDMMC_RTC1R_TMREN_Pos)              /* (SDMMC_RTC1R) Retuning Timer Enable Mask */
#define SDMMC_RTC1R_TMREN(value)              (SDMMC_RTC1R_TMREN_Msk & (_UINT8_(value) << SDMMC_RTC1R_TMREN_Pos)) /* Assigment of value for TMREN in the SDMMC_RTC1R register */
#define   SDMMC_RTC1R_TMREN_DISABLED_Val      _UINT8_(0x0)                                         /* (SDMMC_RTC1R) The retuning timer is disabled.  */
#define   SDMMC_RTC1R_TMREN_ENABLED_Val       _UINT8_(0x1)                                         /* (SDMMC_RTC1R) The retuning timer is enabled.  */
#define SDMMC_RTC1R_TMREN_DISABLED            (SDMMC_RTC1R_TMREN_DISABLED_Val << SDMMC_RTC1R_TMREN_Pos) /* (SDMMC_RTC1R) The retuning timer is disabled. Position  */
#define SDMMC_RTC1R_TMREN_ENABLED             (SDMMC_RTC1R_TMREN_ENABLED_Val << SDMMC_RTC1R_TMREN_Pos) /* (SDMMC_RTC1R) The retuning timer is enabled. Position  */
#define SDMMC_RTC1R_Msk                       _UINT8_(0x01)                                        /* (SDMMC_RTC1R) Register Mask  */


/* -------- SDMMC_RTC2R : (SDMMC Offset: 0x211) ( /W 8) Retuning Timer Control 2 Register -------- */
#define SDMMC_RTC2R_RLD_Pos                   _UINT8_(0)                                           /* (SDMMC_RTC2R) Retuning Timer Reload Position */
#define SDMMC_RTC2R_RLD_Msk                   (_UINT8_(0x1) << SDMMC_RTC2R_RLD_Pos)                /* (SDMMC_RTC2R) Retuning Timer Reload Mask */
#define SDMMC_RTC2R_RLD(value)                (SDMMC_RTC2R_RLD_Msk & (_UINT8_(value) << SDMMC_RTC2R_RLD_Pos)) /* Assigment of value for RLD in the SDMMC_RTC2R register */
#define SDMMC_RTC2R_Msk                       _UINT8_(0x01)                                        /* (SDMMC_RTC2R) Register Mask  */


/* -------- SDMMC_RTCVR : (SDMMC Offset: 0x214) (R/W 32) Retuning Timer Counter Value Register -------- */
#define SDMMC_RTCVR_TCVAL_Pos                 _UINT32_(0)                                          /* (SDMMC_RTCVR) Retuning Timer Counter Value Position */
#define SDMMC_RTCVR_TCVAL_Msk                 (_UINT32_(0xF) << SDMMC_RTCVR_TCVAL_Pos)             /* (SDMMC_RTCVR) Retuning Timer Counter Value Mask */
#define SDMMC_RTCVR_TCVAL(value)              (SDMMC_RTCVR_TCVAL_Msk & (_UINT32_(value) << SDMMC_RTCVR_TCVAL_Pos)) /* Assigment of value for TCVAL in the SDMMC_RTCVR register */
#define SDMMC_RTCVR_Msk                       _UINT32_(0x0000000F)                                 /* (SDMMC_RTCVR) Register Mask  */


/* -------- SDMMC_RTISTER : (SDMMC Offset: 0x218) (R/W 8) Retuning Timer Interrupt Status Enable Register -------- */
#define SDMMC_RTISTER_TEVT_Pos                _UINT8_(0)                                           /* (SDMMC_RTISTER) Retuning Timer Event Position */
#define SDMMC_RTISTER_TEVT_Msk                (_UINT8_(0x1) << SDMMC_RTISTER_TEVT_Pos)             /* (SDMMC_RTISTER) Retuning Timer Event Mask */
#define SDMMC_RTISTER_TEVT(value)             (SDMMC_RTISTER_TEVT_Msk & (_UINT8_(value) << SDMMC_RTISTER_TEVT_Pos)) /* Assigment of value for TEVT in the SDMMC_RTISTER register */
#define   SDMMC_RTISTER_TEVT_MASKED_Val       _UINT8_(0x0)                                         /* (SDMMC_RTISTER) The TEVT status flag in SDMMC_RTISTR is masked.  */
#define   SDMMC_RTISTER_TEVT_ENABLED_Val      _UINT8_(0x1)                                         /* (SDMMC_RTISTER) The TEVT status flag in SDMMC_RTISTR is enabled.  */
#define SDMMC_RTISTER_TEVT_MASKED             (SDMMC_RTISTER_TEVT_MASKED_Val << SDMMC_RTISTER_TEVT_Pos) /* (SDMMC_RTISTER) The TEVT status flag in SDMMC_RTISTR is masked. Position  */
#define SDMMC_RTISTER_TEVT_ENABLED            (SDMMC_RTISTER_TEVT_ENABLED_Val << SDMMC_RTISTER_TEVT_Pos) /* (SDMMC_RTISTER) The TEVT status flag in SDMMC_RTISTR is enabled. Position  */
#define SDMMC_RTISTER_Msk                     _UINT8_(0x01)                                        /* (SDMMC_RTISTER) Register Mask  */


/* -------- SDMMC_RTISIER : (SDMMC Offset: 0x219) (R/W 8) Retuning Timer Interrupt Signal Enable Register -------- */
#define SDMMC_RTISIER_TEVT_Pos                _UINT8_(0)                                           /* (SDMMC_RTISIER) Retuning Timer Event Position */
#define SDMMC_RTISIER_TEVT_Msk                (_UINT8_(0x1) << SDMMC_RTISIER_TEVT_Pos)             /* (SDMMC_RTISIER) Retuning Timer Event Mask */
#define SDMMC_RTISIER_TEVT(value)             (SDMMC_RTISIER_TEVT_Msk & (_UINT8_(value) << SDMMC_RTISIER_TEVT_Pos)) /* Assigment of value for TEVT in the SDMMC_RTISIER register */
#define   SDMMC_RTISIER_TEVT_MASKED_Val       _UINT8_(0x0)                                         /* (SDMMC_RTISIER) No interrupt is generated when the TEVT status rises in SDMMC_RTISTR.  */
#define   SDMMC_RTISIER_TEVT_ENABLED_Val      _UINT8_(0x1)                                         /* (SDMMC_RTISIER) An interrupt is generated when the TEVT status rises in SDMMC_RTISTR.  */
#define SDMMC_RTISIER_TEVT_MASKED             (SDMMC_RTISIER_TEVT_MASKED_Val << SDMMC_RTISIER_TEVT_Pos) /* (SDMMC_RTISIER) No interrupt is generated when the TEVT status rises in SDMMC_RTISTR. Position  */
#define SDMMC_RTISIER_TEVT_ENABLED            (SDMMC_RTISIER_TEVT_ENABLED_Val << SDMMC_RTISIER_TEVT_Pos) /* (SDMMC_RTISIER) An interrupt is generated when the TEVT status rises in SDMMC_RTISTR. Position  */
#define SDMMC_RTISIER_Msk                     _UINT8_(0x01)                                        /* (SDMMC_RTISIER) Register Mask  */


/* -------- SDMMC_RTISTR : (SDMMC Offset: 0x21C) (R/W 8) Retuning Timer Interrupt Status Register -------- */
#define SDMMC_RTISTR_TEVT_Pos                 _UINT8_(0)                                           /* (SDMMC_RTISTR) Retuning Timer Event Position */
#define SDMMC_RTISTR_TEVT_Msk                 (_UINT8_(0x1) << SDMMC_RTISTR_TEVT_Pos)              /* (SDMMC_RTISTR) Retuning Timer Event Mask */
#define SDMMC_RTISTR_TEVT(value)              (SDMMC_RTISTR_TEVT_Msk & (_UINT8_(value) << SDMMC_RTISTR_TEVT_Pos)) /* Assigment of value for TEVT in the SDMMC_RTISTR register */
#define SDMMC_RTISTR_Msk                      _UINT8_(0x01)                                        /* (SDMMC_RTISTR) Register Mask  */


/* -------- SDMMC_RTSSR : (SDMMC Offset: 0x21D) ( R/ 8) Retuning Timer Status Slots Register -------- */
#define SDMMC_RTSSR_TEVTSLOT_Pos              _UINT8_(0)                                           /* (SDMMC_RTSSR) Retuning Timer Event Slots Position */
#define SDMMC_RTSSR_TEVTSLOT_Msk              (_UINT8_(0x3) << SDMMC_RTSSR_TEVTSLOT_Pos)           /* (SDMMC_RTSSR) Retuning Timer Event Slots Mask */
#define SDMMC_RTSSR_TEVTSLOT(value)           (SDMMC_RTSSR_TEVTSLOT_Msk & (_UINT8_(value) << SDMMC_RTSSR_TEVTSLOT_Pos)) /* Assigment of value for TEVTSLOT in the SDMMC_RTSSR register */
#define SDMMC_RTSSR_Msk                       _UINT8_(0x03)                                        /* (SDMMC_RTSSR) Register Mask  */


/* -------- SDMMC_TUNCR : (SDMMC Offset: 0x220) (R/W 32) Tuning Control Register -------- */
#define SDMMC_TUNCR_SMPLPT_Pos                _UINT32_(0)                                          /* (SDMMC_TUNCR) Sampling Point Position */
#define SDMMC_TUNCR_SMPLPT_Msk                (_UINT32_(0x1) << SDMMC_TUNCR_SMPLPT_Pos)            /* (SDMMC_TUNCR) Sampling Point Mask */
#define SDMMC_TUNCR_SMPLPT(value)             (SDMMC_TUNCR_SMPLPT_Msk & (_UINT32_(value) << SDMMC_TUNCR_SMPLPT_Pos)) /* Assigment of value for SMPLPT in the SDMMC_TUNCR register */
#define SDMMC_TUNCR_Msk                       _UINT32_(0x00000001)                                 /* (SDMMC_TUNCR) Register Mask  */


