Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/bootloader_serial_flash/firmware/src/packs/ATSAMA5D29_DFP/component/sdmmc.h
/* -------- SDMMC_CACR : (SDMMC Offset: 0x230) (R/W 32) Capabilities Control Register -------- */
#define SDMMC_CACR_CAPWREN_Pos                _UINT32_(0)                                          /* (SDMMC_CACR) Capabilities Write Enable Position */
#define SDMMC_CACR_CAPWREN_Msk                (_UINT32_(0x1) << SDMMC_CACR_CAPWREN_Pos)            /* (SDMMC_CACR) Capabilities Write Enable Mask */
#define SDMMC_CACR_CAPWREN(value)             (SDMMC_CACR_CAPWREN_Msk & (_UINT32_(value) << SDMMC_CACR_CAPWREN_Pos)) /* Assigment of value for CAPWREN in the SDMMC_CACR register */
#define SDMMC_CACR_KEY_Pos                    _UINT32_(8)                                          /* (SDMMC_CACR) Key Position */
#define SDMMC_CACR_KEY_Msk                    (_UINT32_(0xFF) << SDMMC_CACR_KEY_Pos)               /* (SDMMC_CACR) Key Mask */
#define SDMMC_CACR_KEY(value)                 (SDMMC_CACR_KEY_Msk & (_UINT32_(value) << SDMMC_CACR_KEY_Pos)) /* Assigment of value for KEY in the SDMMC_CACR register */
#define SDMMC_CACR_Msk                        _UINT32_(0x0000FF01)                                 /* (SDMMC_CACR) Register Mask  */


/* -------- SDMMC_CALCR : (SDMMC Offset: 0x240) (R/W 32) Calibration Control Register -------- */
#define SDMMC_CALCR_EN_Pos                    _UINT32_(0)                                          /* (SDMMC_CALCR) PADs Calibration Enable Position */
#define SDMMC_CALCR_EN_Msk                    (_UINT32_(0x1) << SDMMC_CALCR_EN_Pos)                /* (SDMMC_CALCR) PADs Calibration Enable Mask */
#define SDMMC_CALCR_EN(value)                 (SDMMC_CALCR_EN_Msk & (_UINT32_(value) << SDMMC_CALCR_EN_Pos)) /* Assigment of value for EN in the SDMMC_CALCR register */
#define SDMMC_CALCR_ALWYSON_Pos               _UINT32_(4)                                          /* (SDMMC_CALCR) Calibration Analog Always ON Position */
#define SDMMC_CALCR_ALWYSON_Msk               (_UINT32_(0x1) << SDMMC_CALCR_ALWYSON_Pos)           /* (SDMMC_CALCR) Calibration Analog Always ON Mask */
#define SDMMC_CALCR_ALWYSON(value)            (SDMMC_CALCR_ALWYSON_Msk & (_UINT32_(value) << SDMMC_CALCR_ALWYSON_Pos)) /* Assigment of value for ALWYSON in the SDMMC_CALCR register */
#define SDMMC_CALCR_TUNDIS_Pos                _UINT32_(5)                                          /* (SDMMC_CALCR) Calibration During Tuning Disabled Position */
#define SDMMC_CALCR_TUNDIS_Msk                (_UINT32_(0x1) << SDMMC_CALCR_TUNDIS_Pos)            /* (SDMMC_CALCR) Calibration During Tuning Disabled Mask */
#define SDMMC_CALCR_TUNDIS(value)             (SDMMC_CALCR_TUNDIS_Msk & (_UINT32_(value) << SDMMC_CALCR_TUNDIS_Pos)) /* Assigment of value for TUNDIS in the SDMMC_CALCR register */
#define SDMMC_CALCR_CNTVAL_Pos                _UINT32_(8)                                          /* (SDMMC_CALCR) Calibration Counter Value Position */
#define SDMMC_CALCR_CNTVAL_Msk                (_UINT32_(0xFF) << SDMMC_CALCR_CNTVAL_Pos)           /* (SDMMC_CALCR) Calibration Counter Value Mask */
#define SDMMC_CALCR_CNTVAL(value)             (SDMMC_CALCR_CNTVAL_Msk & (_UINT32_(value) << SDMMC_CALCR_CNTVAL_Pos)) /* Assigment of value for CNTVAL in the SDMMC_CALCR register */
#define SDMMC_CALCR_CALN_Pos                  _UINT32_(16)                                         /* (SDMMC_CALCR) Calibration N Status Position */
#define SDMMC_CALCR_CALN_Msk                  (_UINT32_(0xF) << SDMMC_CALCR_CALN_Pos)              /* (SDMMC_CALCR) Calibration N Status Mask */
#define SDMMC_CALCR_CALN(value)               (SDMMC_CALCR_CALN_Msk & (_UINT32_(value) << SDMMC_CALCR_CALN_Pos)) /* Assigment of value for CALN in the SDMMC_CALCR register */
#define SDMMC_CALCR_CALP_Pos                  _UINT32_(24)                                         /* (SDMMC_CALCR) Calibration P Status Position */
#define SDMMC_CALCR_CALP_Msk                  (_UINT32_(0xF) << SDMMC_CALCR_CALP_Pos)              /* (SDMMC_CALCR) Calibration P Status Mask */
#define SDMMC_CALCR_CALP(value)               (SDMMC_CALCR_CALP_Msk & (_UINT32_(value) << SDMMC_CALCR_CALP_Pos)) /* Assigment of value for CALP in the SDMMC_CALCR register */
#define SDMMC_CALCR_Msk                       _UINT32_(0x0F0FFF31)                                 /* (SDMMC_CALCR) Register Mask  */


/** \brief SDMMC register offsets definitions */
#define SDMMC_SSAR_REG_OFST            _UINT32_(0x00)      /* (SDMMC_SSAR) SDMA System Address / Argument 2 Register Offset */
#define SDMMC_BSR_REG_OFST             _UINT32_(0x04)      /* (SDMMC_BSR) Block Size Register Offset */
#define SDMMC_BCR_REG_OFST             _UINT32_(0x06)      /* (SDMMC_BCR) Block Count Register Offset */
#define SDMMC_ARG1R_REG_OFST           _UINT32_(0x08)      /* (SDMMC_ARG1R) Argument 1 Register Offset */
#define SDMMC_TMR_REG_OFST             _UINT32_(0x0C)      /* (SDMMC_TMR) Transfer Mode Register Offset */
#define SDMMC_CR_REG_OFST              _UINT32_(0x0E)      /* (SDMMC_CR) Command Register Offset */
#define SDMMC_RR_REG_OFST              _UINT32_(0x10)      /* (SDMMC_RR) Response Register Offset */
#define SDMMC_RR0_REG_OFST             _UINT32_(0x10)      /* (SDMMC_RR0) Response Register Offset */
#define SDMMC_RR1_REG_OFST             _UINT32_(0x14)      /* (SDMMC_RR1) Response Register Offset */
#define SDMMC_RR2_REG_OFST             _UINT32_(0x18)      /* (SDMMC_RR2) Response Register Offset */
#define SDMMC_RR3_REG_OFST             _UINT32_(0x1C)      /* (SDMMC_RR3) Response Register Offset */
#define SDMMC_BDPR_REG_OFST            _UINT32_(0x20)      /* (SDMMC_BDPR) Buffer Data Port Register Offset */
#define SDMMC_PSR_REG_OFST             _UINT32_(0x24)      /* (SDMMC_PSR) Present State Register Offset */
#define SDMMC_HC1R_REG_OFST            _UINT32_(0x28)      /* (SDMMC_HC1R) Host Control 1 Register Offset */
#define SDMMC_PCR_REG_OFST             _UINT32_(0x29)      /* (SDMMC_PCR) Power Control Register Offset */
#define SDMMC_BGCR_REG_OFST            _UINT32_(0x2A)      /* (SDMMC_BGCR) Block Gap Control Register Offset */
#define SDMMC_WCR_REG_OFST             _UINT32_(0x2B)      /* (SDMMC_WCR) Wakeup Control Register Offset */
#define SDMMC_CCR_REG_OFST             _UINT32_(0x2C)      /* (SDMMC_CCR) Clock Control Register Offset */
#define SDMMC_TCR_REG_OFST             _UINT32_(0x2E)      /* (SDMMC_TCR) Timeout Control Register Offset */
#define SDMMC_SRR_REG_OFST             _UINT32_(0x2F)      /* (SDMMC_SRR) Software Reset Register Offset */
#define SDMMC_NISTR_REG_OFST           _UINT32_(0x30)      /* (SDMMC_NISTR) Normal Interrupt Status Register Offset */
#define SDMMC_EISTR_REG_OFST           _UINT32_(0x32)      /* (SDMMC_EISTR) Error Interrupt Status Register Offset */
#define SDMMC_NISTER_REG_OFST          _UINT32_(0x34)      /* (SDMMC_NISTER) Normal Interrupt Status Enable Register Offset */
#define SDMMC_EISTER_REG_OFST          _UINT32_(0x36)      /* (SDMMC_EISTER) Error Interrupt Status Enable Register Offset */
#define SDMMC_NISIER_REG_OFST          _UINT32_(0x38)      /* (SDMMC_NISIER) Normal Interrupt Signal Enable Register Offset */
#define SDMMC_EISIER_REG_OFST          _UINT32_(0x3A)      /* (SDMMC_EISIER) Error Interrupt Signal Enable Register Offset */
#define SDMMC_ACESR_REG_OFST           _UINT32_(0x3C)      /* (SDMMC_ACESR) Auto CMD Error Status Register Offset */
#define SDMMC_HC2R_REG_OFST            _UINT32_(0x3E)      /* (SDMMC_HC2R) Host Control 2 Register Offset */
#define SDMMC_CA0R_REG_OFST            _UINT32_(0x40)      /* (SDMMC_CA0R) Capabilities 0 Register Offset */
#define SDMMC_CA1R_REG_OFST            _UINT32_(0x44)      /* (SDMMC_CA1R) Capabilities 1 Register Offset */
#define SDMMC_MCCAR_REG_OFST           _UINT32_(0x48)      /* (SDMMC_MCCAR) Maximum Current Capabilities Register Offset */
#define SDMMC_FERACES_REG_OFST         _UINT32_(0x50)      /* (SDMMC_FERACES) Force Event Register for Auto CMD Error Status Offset */
#define SDMMC_FEREIS_REG_OFST          _UINT32_(0x52)      /* (SDMMC_FEREIS) Force Event Register for Error Interrupt Status Offset */
#define SDMMC_AESR_REG_OFST            _UINT32_(0x54)      /* (SDMMC_AESR) ADMA Error Status Register Offset */
#define SDMMC_ASAR0_REG_OFST           _UINT32_(0x58)      /* (SDMMC_ASAR0) ADMA System Address Register 0 Offset */
#define SDMMC_PVR_REG_OFST             _UINT32_(0x60)      /* (SDMMC_PVR) Preset Value Register 0 (for initialization) Offset */
#define SDMMC_PVR0_REG_OFST            _UINT32_(0x60)      /* (SDMMC_PVR0) Preset Value Register 0 (for initialization) Offset */
#define SDMMC_PVR1_REG_OFST            _UINT32_(0x62)      /* (SDMMC_PVR1) Preset Value Register 0 (for initialization) Offset */
#define SDMMC_PVR2_REG_OFST            _UINT32_(0x64)      /* (SDMMC_PVR2) Preset Value Register 0 (for initialization) Offset */
#define SDMMC_PVR3_REG_OFST            _UINT32_(0x66)      /* (SDMMC_PVR3) Preset Value Register 0 (for initialization) Offset */
#define SDMMC_PVR4_REG_OFST            _UINT32_(0x68)      /* (SDMMC_PVR4) Preset Value Register 0 (for initialization) Offset */
#define SDMMC_PVR5_REG_OFST            _UINT32_(0x6A)      /* (SDMMC_PVR5) Preset Value Register 0 (for initialization) Offset */
#define SDMMC_PVR6_REG_OFST            _UINT32_(0x6C)      /* (SDMMC_PVR6) Preset Value Register 0 (for initialization) Offset */
#define SDMMC_PVR7_REG_OFST            _UINT32_(0x6E)      /* (SDMMC_PVR7) Preset Value Register 0 (for initialization) Offset */
#define SDMMC_SISR_REG_OFST            _UINT32_(0xFC)      /* (SDMMC_SISR) Slot Interrupt Status Register Offset */
#define SDMMC_HCVR_REG_OFST            _UINT32_(0xFE)      /* (SDMMC_HCVR) Host Controller Version Register Offset */
#define SDMMC_APSR_REG_OFST            _UINT32_(0x200)     /* (SDMMC_APSR) Additional Present State Register Offset */
#define SDMMC_MC1R_REG_OFST            _UINT32_(0x204)     /* (SDMMC_MC1R) e.MMC Control 1 Register Offset */
#define SDMMC_MC2R_REG_OFST            _UINT32_(0x205)     /* (SDMMC_MC2R) e.MMC Control 2 Register Offset */
#define SDMMC_ACR_REG_OFST             _UINT32_(0x208)     /* (SDMMC_ACR) AHB Control Register Offset */
#define SDMMC_CC2R_REG_OFST            _UINT32_(0x20C)     /* (SDMMC_CC2R) Clock Control 2 Register Offset */
#define SDMMC_RTC1R_REG_OFST           _UINT32_(0x210)     /* (SDMMC_RTC1R) Retuning Timer Control 1 Register Offset */
#define SDMMC_RTC2R_REG_OFST           _UINT32_(0x211)     /* (SDMMC_RTC2R) Retuning Timer Control 2 Register Offset */
#define SDMMC_RTCVR_REG_OFST           _UINT32_(0x214)     /* (SDMMC_RTCVR) Retuning Timer Counter Value Register Offset */
#define SDMMC_RTISTER_REG_OFST         _UINT32_(0x218)     /* (SDMMC_RTISTER) Retuning Timer Interrupt Status Enable Register Offset */
#define SDMMC_RTISIER_REG_OFST         _UINT32_(0x219)     /* (SDMMC_RTISIER) Retuning Timer Interrupt Signal Enable Register Offset */
#define SDMMC_RTISTR_REG_OFST          _UINT32_(0x21C)     /* (SDMMC_RTISTR) Retuning Timer Interrupt Status Register Offset */
#define SDMMC_RTSSR_REG_OFST           _UINT32_(0x21D)     /* (SDMMC_RTSSR) Retuning Timer Status Slots Register Offset */
#define SDMMC_TUNCR_REG_OFST           _UINT32_(0x220)     /* (SDMMC_TUNCR) Tuning Control Register Offset */
#define SDMMC_CACR_REG_OFST            _UINT32_(0x230)     /* (SDMMC_CACR) Capabilities Control Register Offset */
#define SDMMC_CALCR_REG_OFST           _UINT32_(0x240)     /* (SDMMC_CALCR) Calibration Control Register Offset */

